/* ----------
 
 
 This file is only needed if you are defining a custom importer attribute.  
 Most importer plugins will not need to do this.  
 Add this file to your project's localized resources if you have defined a custom attribute. 
 
 
 ----------*/


/* Localized DisplayNames for your custom metadata attributes */
/* The form is:  "myMetadataKey" = "My Metadata Key";    */
/* The name on the left is the name defined in schema.xml */
/* The name on the right is what the user will see */
"com_markdouma_image_compression" = "Compression";
"com_markdouma_image_mipmaps" = "Mipmaps";
"com_markdouma_image_animated" = "Animated";
"com_markdouma_image_environment_map" = "Environment Map";


/* Localized Description of you custom metadata attributes */
/* The form is: "myMetadataKey.Description" = "stuff";
/* com_Foo_YourAttrName should be definded in the schema.xml file  */
/* The value on the right will be displayed by the Finder etc.. */
"com_markdouma_image_compression.Description" = "The type of compression used in the Texture Image";
"com_markdouma_image_mipmaps.Description" = "Whether the Texture Image contains mipmaps";
"com_markdouma_image_animated.Description" = "Whether the Texture Image is animated";
"com_markdouma_image_environment_map.Description" = "Whether the Texture Image is an environment map (cube-map or sphere-map)";

